# 자폐아
autistic <- c(
  755, 365, 820, 900, 170,
  300, 325, 385, 380, 215,
  400, 343, 415, 345, 410,
  460, 225, 440, 400, 360,
  435, 450, 360
)
# 정상아
normal <- c(
  165, 390, 290, 435, 235,
  345, 320, 330, 205, 375,
  345, 305, 220, 270, 355,
  360, 335, 305, 325, 245,
  285, 370, 345, 345, 230,
  370, 285, 315, 195, 270,
  305, 375, 220
)
# 지진아
retard <- c(
  380, 510, 315, 565, 715,
  380, 390, 245, 155, 335,
  295, 200, 105, 105, 245
)
rate <- c(
  autistic,
  normal,
  retard
)
group <- factor(rep(c('자폐아', '정상아', '지진아'), c(length(autistic), length(normal), length(retard))))
aov_result <- aov(rate ~ group)

hsd<-TukeyHSD(aov_result)
hsd
plot(hsd,col=2:4)